Revit 2027 API
TableSectionData.GetCellType(Int32) Method
 Returns a column's cell type and if no type exists for this column, it would come from the section
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CellType GetCellType(
	int nCol
)
Public Function GetCellType (
	nCol As Integer
) As CellType
public:
CellType GetCellType(
	int nCol
)
member GetCellType :
        nCol : int -> CellType
Parameters
nCol Int32
Return Value
CellType
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellType Overload
Autodesk.Revit.DB Namespace